DataProcessors/ГрупповоеРедактированиеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеРедактированиеНачислений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НалогообложениеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалогообложениеНачислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияИПН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОППВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОППВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияВОСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюВОСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияООСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюООСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияЕП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюЕП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/УчетНачисленийВСреднемЗаработкеОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеОбщий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийЗаработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПроцентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяПроцентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетаСреднегоЗаработкаОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетаСреднегоЗаработкаОбщий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постановление2010</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетаСреднегоЗаработкаФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетаСреднегоЗаработкаФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постановление2010</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постановление2011</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УчетНачисленийВСреднемЗаработкеФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитыватьПриОплатеБольничногоЗаСчетРаботодателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыполненияНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыВыполненияНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтдельномуДокументуДоОкончательногоРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗаданныхМесяцахПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗначениюПоказателяПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗначениюВидаВремениПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПраздничныеДниПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыНалогообложенияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНалогообложенияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ГрупповоеРедактированиеНачислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Функция КомандыПечати() Экспорт
	КомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// Облагаемая база НДФЛ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ОблагаемаяБазаНДФЛ";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 10;
	КомандаПечати.Представление = НСтр("ru = 'Облагаемая база НДФЛ'");
	КонецЕсли;
	// ЗУПК
	
	// Состав среднего заработка (командировки, отпуска и др.).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "СоставСреднегоЗаработкаОбщего";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 20;
	// ЗУПК
	КомандаПечати.Представление = НСтр("ru = 'Состав среднего заработка (больничные, отпуска и др.)'");
	// ЗУПК
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// Состав среднего заработка (расчет пособий по правилам до 1 января 2011 года).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "СоставСреднегоЗаработкаФСС";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 30;
	КомандаПечати.Представление = НСтр("ru = 'Состав среднего заработка (расчет пособий по правилам до 1 января 2011 года)'");
	КонецЕсли;
	// ЗУПК
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// Расчетная база ПФР, ФСС, ФОМС.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "РасчетнаяБазаСтраховыхВзносов";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 40;
	КомандаПечати.Представление = НСтр("ru = 'Расчетная база ПФР, ФСС, ФОМС'");
	КонецЕсли;
	// ЗУПК
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// Статистическая отчетность.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "СтатистическаяОтчетность";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 50;
	КомандаПечати.Представление = НСтр("ru = 'Статистическая отчетность'");
	КонецЕсли;
	// ЗУПК
	
	// Состав ФОТ.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "СоставФОТ";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 50;
	КомандаПечати.Представление = НСтр("ru = 'Состав ФОТ'");
	
	Возврат КомандыПечати;
КонецФункции

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ГрупповоеРедактированиеНачислений.ПФ_MXL_СписокНачислений");
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОблагаемаяБазаНДФЛ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ОблагаемаяБазаНДФЛ",
			НСтр("ru = 'Список начислений'"),
			ПечатнаяФормаБазаНДФЛ(Макет, "ОблагаемаяБазаНДФЛ", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставСреднегоЗаработкаОбщего") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СоставСреднегоЗаработкаОбщего",
			НСтр("ru = 'Список начислений'"),
			ПечатнаяФормаБазаСреднегоЗаработкаОбщего(Макет, "СоставСреднегоЗаработкаОбщего", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставСреднегоЗаработкаФСС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СоставСреднегоЗаработкаФСС",
			НСтр("ru = 'Список начислений'"),
			ПечатнаяФормаБазаСреднегоЗаработкаФСС(Макет, "СоставСреднегоЗаработкаФСС", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетнаяБазаСтраховыхВзносов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"РасчетнаяБазаСтраховыхВзносов",
			НСтр("ru = 'Список начислений'"),
			ПечатнаяФормаБазаСтраховыхВзносов(Макет, "РасчетнаяБазаСтраховыхВзносов", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СтатистическаяОтчетность") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СтатистическаяОтчетность",
			НСтр("ru = 'Список начислений'"),
			ПечатнаяФормаСтатистическаяОтчетность(Макет, "СтатистическаяОтчетность", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставФОТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СоставФОТ",
			НСтр("ru = 'Состав ФОТ'"),
			ПечатнаяФормаСоставФОТ(Макет, "СоставФОТ", ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцедурыПечатиСписковНачислений

Функция ПечатнаяФормаБазаНДФЛ(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаКодДоходаНДФЛ = Макет.ПолучитьОбласть("Шапка|КодДоходаНДФЛ");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаКодДоходаНДФЛ = Макет.ПолучитьОбласть("СтрокаТаблицы|КодДоходаНДФЛ");
	
	ДанныеДляПечати = ОблагаемаяБазаНДФЛ();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Облагаемая база НДФЛ'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаКодДоходаНДФЛ);
	
	Выборка = ДанныеДляПечати.ОблагаетсяНДФЛ.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаКодДоходаНДФЛ.Параметры.КодДоходаНДФЛ = Выборка.КодДоходаНДФЛСтрока;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаКодДоходаНДФЛ);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаБазаСреднегоЗаработкаОбщего(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаУчетНачислений = Макет.ПолучитьОбласть("Шапка|УчетНачислений");
	ОбластьШапкаИндексируется = Макет.ПолучитьОбласть("Шапка|Индексируется");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаУчетНачислений = Макет.ПолучитьОбласть("СтрокаТаблицы|УчетНачислений");
	ОбластьСтрокаИндексируется = Макет.ПолучитьОбласть("СтрокаТаблицы|Индексируется");
	
	ДанныеДляПечати = СоставСреднегоЗаработкаОбщего();
	
	// ЗУПК
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Состав среднего заработка (больничные, отпуска и др.)'");
	// ЗУПК
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаУчетНачислений);
	ТабДокумент.Присоединить(ОбластьШапкаИндексируется);
	
	Выборка = ДанныеДляПечати.ВходитВСоставСреднегоЗаработка.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаУчетНачислений.Параметры.УчетНачислений = Выборка.УчетНачисленийВСреднемЗаработкеОбщий;
		ОбластьСтрокаИндексируется.Параметры.Индексируется = Выборка.Индексируется;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаУчетНачислений);
		ТабДокумент.Присоединить(ОбластьСтрокаИндексируется);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаБазаСреднегоЗаработкаФСС(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	
	ДанныеДляПечати = СоставСреднегоЗаработкаФСС();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Состав среднего заработка (расчет пособий по правилам до 1 января 2011 года)'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	
	Выборка = ДанныеДляПечати.ВходитВСоставСреднегоЗаработка.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаБазаСтраховыхВзносов(Макет,ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаКодДоходаСтраховыеВзносы = Макет.ПолучитьОбласть("Шапка|КодДоходаСтраховыеВзносы");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаКодДоходаСтраховыеВзносы = Макет.ПолучитьОбласть("СтрокаТаблицы|КодДоходаСтраховыеВзносы");
	
	ДанныеДляПечати = РасчетнаяБазаСтраховыхВзносов();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Расчетная база ПФР, ФСС, ФОМС'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаКодДоходаСтраховыеВзносы);
	
	Выборка = ДанныеДляПечати.ОблагаетсяЦеликом.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаКодДоходаСтраховыеВзносы.Параметры.КодДоходаСтраховыеВзносы = Выборка.КодДоходаСтраховыеВзносыНаименование;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаКодДоходаСтраховыеВзносы);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаСтатистическаяОтчетность(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаКатегорияСтатистическогоНаблюдения = Макет.ПолучитьОбласть("Шапка|СтатистическаяОтчетность");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаКатегорияСтатистическогоНаблюдения = Макет.ПолучитьОбласть("СтрокаТаблицы|СтатистическаяОтчетность");
	
	ДанныеДляПечати = СтатистическаяОтчетность();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Статистическая отчетность'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаКатегорияСтатистическогоНаблюдения);
	
	Выборка = ДанныеДляПечати.СтатистическаяОтчетность.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаКатегорияСтатистическогоНаблюдения.Параметры.КатегорияСтатистическогоНаблюдения = Выборка.КатегорияСтатистическогоНаблюдения;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаКатегорияСтатистическогоНаблюдения);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаСоставФОТ(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СоставФОТ";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	
	ДанныеДляПечати = СоставФОТ();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru = 'Состав ФОТ'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	
	Выборка = ДанныеДляПечати.ВходятВФОТ.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ОблагаемаяБазаНДФЛ() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование,
	               |	Начисления.КодДоходаНДФЛ.Код КАК КодДоходаНДФЛСтрока
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию) КАК КодДоходаНДФЛ,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	БазаНДФЛ = Новый Структура;
	БазаНДФЛ.Вставить("ОблагаетсяНДФЛ", РезультатыЗапроса[0]);
	БазаНДФЛ.Вставить("НеОблагаетсяНДФЛ", РезультатыЗапроса[1]);
	
	Возврат БазаНДФЛ;
	
КонецФункции	

Функция СоставСреднегоЗаработкаОбщего() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НачисленияСреднийЗаработокОбщий.Ссылка КАК ВидРасчета,
	               |	НачисленияСреднийЗаработокОбщий.Значение КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	НачисленияСреднийЗаработокОбщий.Индексируется КАК Индексируется
	               |ПОМЕСТИТЬ ВТСреднийЗаработокОбщий
	               |ИЗ
	               |	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
	               |ГДЕ
	               |	НачисленияСреднийЗаработокОбщий.Значение <> ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать)
	               |	И НачисленияСреднийЗаработокОбщий.ПорядокРасчета = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление2010)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТСреднийЗаработокОбщий.ВидРасчета КАК ВидРасчета,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	               |	ВТСреднийЗаработокОбщий.УчетНачисленийВСреднемЗаработкеОбщий КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	ВТСреднийЗаработокОбщий.Индексируется КАК Индексируется,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ВТСреднийЗаработокОбщий КАК ВТСреднийЗаработокОбщий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок) КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	ЛОЖЬ КАК Индексируется,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	НЕ Начисления.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТСреднийЗаработокОбщий.ВидРасчета
	               |				ИЗ
	               |					ВТСреднийЗаработокОбщий КАК ВТСреднийЗаработокОбщий)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();			   
	
	БазаСреднегоЗаработкаОбщего = Новый Структура;
	БазаСреднегоЗаработкаОбщего.Вставить("ВходитВСоставСреднегоЗаработка", РезультатыЗапроса[1]);
	БазаСреднегоЗаработкаОбщего.Вставить("НеВходитВСоставСреднегоЗаработка", РезультатыЗапроса[2]);
	
	Возврат БазаСреднегоЗаработкаОбщего;
	
КонецФункции

Функция СоставСреднегоЗаработкаФСС() Экспорт 

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НачисленияСреднийЗаработокФСС.Ссылка КАК ВидРасчета
	               |ПОМЕСТИТЬ ВТСреднийЗаработокФСС2010
	               |ИЗ
	               |	ПланВидовРасчета.Начисления.СреднийЗаработокФСС КАК НачисленияСреднийЗаработокФСС
	               |ГДЕ
	               |	НачисленияСреднийЗаработокФСС.ПорядокРасчета = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаСреднегоЗаработкаФСС.Постановление2010)
	               |	И НачисленияСреднийЗаработокФСС.Значение = ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеФСС.Включать)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТСреднийЗаработокФСС2010.ВидРасчета КАК ВидРасчета,
	               |	ВТСреднийЗаработокФСС2010.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	               |	ВТСреднийЗаработокФСС2010.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	ВТСреднийЗаработокФСС2010.ВидРасчета.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	               |ИЗ
	               |	ВТСреднийЗаработокФСС2010 КАК ВТСреднийЗаработокФСС2010
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	НЕ Начисления.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТСреднийЗаработокФСС2010.ВидРасчета
	               |				ИЗ
	               |					ВТСреднийЗаработокФСС2010 КАК ВТСреднийЗаработокФСС2010)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();			   
	
	БазаСреднегоЗаработкаФСС = Новый Структура;
	БазаСреднегоЗаработкаФСС.Вставить("ВходитВСоставСреднегоЗаработка", РезультатыЗапроса[1]);
	БазаСреднегоЗаработкаФСС.Вставить("НеВходитВСоставСреднегоЗаработка", РезультатыЗапроса[2]);
	
	Возврат БазаСреднегоЗаработкаФСС;
	
КонецФункции

Функция РасчетнаяБазаСтраховыхВзносов() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.КодДоходаСтраховыеВзносы КАК КодДоходаСтраховыеВзносы,
	               |	Начисления.КодДоходаСтраховыеВзносы.Наименование КАК КодДоходаСтраховыеВзносыНаименование,
	               |	ИСТИНА КАК ТолькоПросмотр
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуПФР = ИСТИНА
	               |	И Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуФСС = ИСТИНА
	               |	И Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуФОМС = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.КодДоходаСтраховыеВзносы КАК КодДоходаСтраховыеВзносы,
	               |	ИСТИНА КАК ТолькоПросмотр
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуПФР = ЛОЖЬ
	               |	И Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуФСС = ЛОЖЬ
	               |	И Начисления.КодДоходаСтраховыеВзносы.ВходитВБазуФОМС = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	БазаСтраховыхВзносов = Новый Структура;
	БазаСтраховыхВзносов.Вставить("ОблагаетсяЦеликом", РезультатыЗапроса[0]);
	БазаСтраховыхВзносов.Вставить("НеОблагается", РезультатыЗапроса[1]);
	
	Возврат БазаСтраховыхВзносов;
	
КонецФункции

Функция СтатистическаяОтчетность() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.КатегорияСтатистическогоНаблюдения КАК КатегорияСтатистическогоНаблюдения,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КатегорияСтатистическогоНаблюдения <> ЗНАЧЕНИЕ(Перечисление.КатегорииСтатистическогоНаблюдения.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.КатегорияСтатистическогоНаблюдения КАК КатегорияСтатистическогоНаблюдения,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КатегорияСтатистическогоНаблюдения = ЗНАЧЕНИЕ(Перечисление.КатегорииСтатистическогоНаблюдения.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	БазаНДФЛ = Новый Структура;
	БазаНДФЛ.Вставить("СтатистическаяОтчетность", РезультатыЗапроса[0]);
	БазаНДФЛ.Вставить("НеСтатистическаяОтчетность", РезультатыЗапроса[1]);
	
	Возврат БазаНДФЛ;
	
КонецФункции	

Функция СоставФОТ() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.СпособВыполненияНачисления В(&СпособВыполненияНачисления)
	               |	И Начисления.ВключатьВФОТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.СпособВыполненияНачисления В(&СпособВыполненияНачисления)
	               |	И НЕ Начисления.ВключатьВФОТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	СпособыВыполненияНачисления = Новый Массив;
	СпособыВыполненияНачисления.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыполненияНачислений.ЕжемесячноПриОкончательномРасчете"));
	СпособыВыполненияНачисления.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыполненияНачислений.ВЗаданныхМесяцахПриОкончательномРасчете"));
	Запрос.УстановитьПараметр("СпособВыполненияНачисления", СпособыВыполненияНачисления);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	СоставФОТ = Новый Структура;
	СоставФОТ.Вставить("ВходятВФОТ", РезультатыЗапроса[0]);
	СоставФОТ.Вставить("НеВходятВФОТ", РезультатыЗапроса[1]);
	
	Возврат СоставФОТ;
	
КонецФункции	

// ЗУПК
Функция СоставНалогиВзносыОтчисления(ДатаАктуальности, ВидДохода = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК ВидРасчета,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияИПН,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюИПН,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияОПВ,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюОПВ,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияСН,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюСН,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияСО,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюСО,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияОППВ,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюОППВ,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияВОСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияВОСМС,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюВОСМС, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюВОСМС,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияООСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияООСМС,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюООСМС, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюООСМС,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВР, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияОПВР,
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВР, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюОПВР,
		|	Начисления.РеквизитДопУпорядочивания
		|ПОМЕСТИТЬ ВТ_НалогообложениеНачислений
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ДатаАктуальности, ) КАК НалогообложениеНачисленийСрезПоследних
		|		ПО (НалогообложениеНачисленийСрезПоследних.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) = &ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСО КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСО КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСО КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияСН КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОППВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОППВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОППВ КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияООСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияООСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияООСМС КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВР КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВР КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВР = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВР КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВР КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВР = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.ВидРасчета,
		|	НалогообложениеНачислений.СпособОбложенияОПВР КАК СпособОбложения,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВР КАК ДоходНеПодлежащийНалогообложению,
		|	НалогообложениеНачислений.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.СпособОбложенияОПВР = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания";
		
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ВидДохода", ?(ВидДохода = Неопределено, Справочники.ВидыДоходов.ДоходыОтРаботодателя, ВидДохода));
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	СоставНалогиВзносыОтчисления = Новый Структура;
	// ИПН
	СоставНалогиВзносыОтчисления.Вставить("НачисленияИПН", РезультатыЗапроса[1]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияИПННеОблагаются", РезультатыЗапроса[2]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияИПННеОблагаютсяЧастично", РезультатыЗапроса[3]);
	// ОПВ
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВ", РезультатыЗапроса[4]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВНеОблагаются", РезультатыЗапроса[5]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВНеОблагаютсяЧастично", РезультатыЗапроса[6]);
	// СО
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСО", РезультатыЗапроса[7]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСОНеОблагаются", РезультатыЗапроса[8]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСОНеОблагаютсяЧастично", РезультатыЗапроса[9]);
	// СН
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСН", РезультатыЗапроса[10]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСННеОблагаются", РезультатыЗапроса[11]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияСННеОблагаютсяЧастично", РезультатыЗапроса[12]);
	// ОППВ
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОППВ", РезультатыЗапроса[13]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОППВНеОблагаются", РезультатыЗапроса[14]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОППВНеОблагаютсяЧастично", РезультатыЗапроса[15]);
	// ВОСМС
	СоставНалогиВзносыОтчисления.Вставить("НачисленияВОСМС", РезультатыЗапроса[16]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияВОСМСНеОблагаются", РезультатыЗапроса[17]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияВОСМСНеОблагаютсяЧастично", РезультатыЗапроса[18]);
	// ООСМС
	СоставНалогиВзносыОтчисления.Вставить("НачисленияООСМС", РезультатыЗапроса[19]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияООСМСНеОблагаются", РезультатыЗапроса[20]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияООСМСНеОблагаютсяЧастично", РезультатыЗапроса[21]);
	// ОПВР
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВР", РезультатыЗапроса[22]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВРНеОблагаются", РезультатыЗапроса[23]);
	СоставНалогиВзносыОтчисления.Вставить("НачисленияОПВРНеОблагаютсяЧастично", РезультатыЗапроса[24]);
	
	Возврат СоставНалогиВзносыОтчисления;
	
КонецФункции
// ЗУПК

#КонецОбласти

#КонецОбласти

#КонецЕсли
